backend/load_tests/user-auth.yml
## Account and Profile Creation

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 50
    - duration: 30
      arrivalRate: 20
    - duration: 10
      arrivalRate: 50
  processor: "./create-user-data.js"
scenarios:
  - name: "Create Accounts and Profiles"
    flow:
      - function: "create"
      - post:
          url: "/signup"
          json: 
            username: "{{ username }}"
            email: "{{ email }}"
            password: "{{ password }}"
          capture: 
            json: "$.token"
            as: "token"
      - post:
          url: "/profile"
          headers: 
            Authorization: "Bearer {{ token }}"
          json:
            firstName: "{{ firstName }}"
            age: "{{ age }}"
            homeState: "{{ homeState }}"